-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               8.0.12 - MySQL Community Server - GPL
-- Server OS:                    Linux
-- HeidiSQL Version:             12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

/*
루루의 상점에서 등록할 탭 위치 및 정렬 위치 값 설정
[main_tab] 메인 탭으로 아래와 같은 이름으로 분류됨.
메인(id: 1), 게임플레이(id: 2), 운송수단(id: 3), 하우징(id: 4), 외형(id: 5), 루루딱지(id: 6)

[sub_tab] 서브 탭으로 메인 탭별로 아래와 같은 이름으로 분류됨.
메인 [한정판매(id: 1), 추천(id: 2), 신규(id: 3), 전체(id: 4), sub_menu_1_5(id: 5), sub_menu_1_6(id: 6), sub_menu_1_7(id: 7)]
게임플레이 [전체(id: 1), 소비(id: 2), 편의(id: 3), 캐릭터(id: 4), sub_menu_2_5(id: 5), sub_menu_2_6(id: 6), 기타(id: 7)]
운송수단 [전체(id: 1), 날틀(id: 2), 소환수(id: 3), sub_menu_3_4(id: 4), sub_menu_3_5(id: 5), sub_menu_3_6(id: 6), sub_menu_3_7(id: 7)]
하우징 [전체(id: 1), 소유지(id: 2), 가구(id: 3), sub_menu_4_4(id: 4), sub_menu_4_5(id: 5), sub_menu_4_6(id: 6), 기타(id: 7)]
외형 [전체(id: 1), 소비(id: 2), 코스튬(id: 3), UCC아이템(id: 4), sub_menu_5_5(id: 5), sub_menu_5_6(id: 6), sub_menu_5_7(id: 7)]
루루딱지 [전체(id: 1), 아이템(id: 2), 소비(id: 3), 외형(id: 4), 펫(id: 5), sub_menu_6_6(id: 6), 기타(id: 7)]

[tab_pos] 각 속한 탭에서 순서 값

[shop_id] 상품 묶음 유니크 값
*/

-- Dumping structure for table aaemu_game.ics_menu
DROP TABLE IF EXISTS `ics_menu`;
CREATE TABLE IF NOT EXISTS `ics_menu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `main_tab` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT 'Which main tab to display on',
  `sub_tab` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT 'Which sub tab to display on',
  `tab_pos` int(11) NOT NULL DEFAULT '0' COMMENT 'Used to change display order',
  `shop_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'Id of the item group for sale (shop item)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=177 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Contains what item will be displayed on which tab';

-- Dumping data for table aaemu_game.ics_menu
REPLACE INTO `ics_menu` (`id`, `main_tab`, `sub_tab`, `tab_pos`, `shop_id`) VALUES
  /* 건물 (6) [하우징 - 전체] */
  (1, 4, 1, 1, 2000000), -- 도면: 양식장(거래가능)
  (2, 4, 1, 2, 2000001), -- 도면: 초가지붕 농장(거래가능)
  (3, 4, 1, 3, 2000002), -- 도면: 시원한 수상 주택(거래가능)
  (4, 4, 1, 4, 2000003), -- 도면: 햇빛 호박머리 허수아비 텃밭(거래가능)
  (5, 4, 1, 5, 2000004), -- 도면: 달빛 호박머리 허수아비 텃밭(거래가능)
  (6, 4, 1, 6, 2000005), -- 도면: 별빛 호박머리 허수아비 텃밭(거래가능)
  (7, 4, 1, 7, 2000006), -- 도면: 만남의 광장(거래가능)
  (8, 4, 1, 8, 2000007), -- 도면: 호박머리 허수아비 원두막(거래가능)
  (9, 4, 1, 9, 2000008), -- 도면: 호박머리 허수아비 텃밭(거래가능)
  (10, 4, 1, 10, 2000009), -- 도면: 밀짚모자 허수아비 텃밭(거래가능)

  /* 고무 (31) [게임플레이 - 기타] */
  (11, 2, 7, 15, 2000010), -- 천연 고무(거래가능)

  /* 광석 (38) [게임플레이 - 전체] */
  (12, 2, 1, 1, 2000011), -- 철광석(거래가능)
  (13, 2, 1, 2, 2000012), -- 구리 광석(거래가능)
  (14, 2, 1, 3, 2000013), -- 은광석(거래가능)
  (15, 2, 1, 4, 2000014), -- 금광석(거래가능)
  (16, 2, 1, 5, 2000015), -- 아키움 광석(거래가능)
  (17, 2, 1, 6, 2000016), -- 별의 파편 조각(거래가능)

  /* 원목 (39) [게임플레이 - 전체] */
	(18, 2, 1, 7, 2000017), -- 통나무(거래가능)
	(19, 2, 1, 8, 2000018), -- 벼락 맞은 나무(거래가능)

	/* 암석 (40) [게임플레이 - 전체] */
	(20, 2, 1, 9, 2000019), -- 암석(거래가능)

	/* 생가죽 (41) [게임플레이 - 전체] */
	(21, 2, 1, 10, 2000020), -- 암석(거래가능)

	/* 섬유 (42) [게임플레이 - 전체] */
	(22, 2, 1, 11, 2000021), -- 오리털(거래가능)
	(23, 2, 1, 12, 2000022), -- 거위털(거래가능)
	(24, 2, 1, 13, 2000023), -- 양털(거래가능)

	/* 고기 (45) [게임플레이 - 기타] */
	(25, 2, 7, 1, 2000024), -- 닭고기
	(26, 2, 7, 2, 2000025), -- 오리고기
	(27, 2, 7, 3, 2000026), -- 거위고기
	(28, 2, 7, 4, 2000027), -- 칠면조 고기
	(29, 2, 7, 5, 2000028), -- 돼지고기
	(30, 2, 7, 6, 2000029), -- 소고기
	(31, 2, 7, 7, 2000030), -- 양고기
  (32, 2, 7, 8, 2000031), -- 염소고기
  (33, 2, 7, 9, 2000032), -- 야타 고기

  /* 수산물 (46) [게임플레이 - 기타] */
  (34, 2, 7, 10, 2000033), -- 붉은색 산호초(거래가능)
  (35, 2, 7, 11, 2000034), -- 녹색 산호초(거래가능)
  (36, 2, 7, 12, 2000035), -- 사슴뿔형 산호초(거래가능)
  (37, 2, 7, 13, 2000036), -- 주황색 산호 더미(거래가능)
  (38, 2, 7, 14, 2000037), -- 노란색 산호 더미(거래가능)

  /* 곡물 (47) [게임플레이 - sub_menu_2_5] */
  (39, 2, 5, 10, 2000038), -- 쌀(거래가능)
  (40, 2, 5, 11, 2000039), -- 귀리(거래가능)
  (41, 2, 5, 12, 2000040), -- 땅콩(거래가능)
  (42, 2, 5, 13, 2000041), -- 밀(거래가능)
  (43, 2, 5, 14, 2000042), -- 보리(거래가능)
  (44, 2, 5, 15, 2000043), -- 옥수수(거래가능)
  (45, 2, 5, 16, 2000044), -- 콩(거래가능)
  (46, 2, 5, 17, 2000045), -- 호밀(거래가능)

  /* 채소 (48) [게임플레이 - sub_menu_2_6] */
  (47, 2, 6, 1, 2000046), -- 블루베리(거래가능)
  (48, 2, 6, 2, 2000047), -- 감자(거래가능)
  (49, 2, 6, 3, 2000048), -- 고구마(거래가능)
  (50, 2, 6, 4, 2000049), -- 당근(거래가능)
  (51, 2, 6, 5, 2000050), -- 마늘(거래가능)
  (52, 2, 6, 6, 2000051), -- 딸기(거래가능)
  (53, 2, 6, 7, 2000052), -- 양파(거래가능)
  (54, 2, 6, 8, 2000053), -- 오이(거래가능)
  (55, 2, 6, 9, 2000054), -- 토마토(거래가능)
  (56, 2, 6, 10, 2000055), -- 호박(거래가능)
  (57, 2, 6, 11, 2000056), -- 고추(거래가능)

  /* 열매 (49) [게임플레이 - sub_menu_2_6] */
  (58, 2, 6, 12, 2000057), -- 사과(거래가능)
  (59, 2, 6, 13, 2000058), -- 석류(거래가능)
  (60, 2, 6, 14, 2000059), -- 아보카도(거래가능)
  (61, 2, 6, 15, 2000060), -- 너도밤나무 열매(거래가능)
  (62, 2, 6, 16, 2000061), -- 대추야자(거래가능)
  (63, 2, 6, 17, 2000062), -- 도토리(거래가능)
  (64, 2, 6, 18, 2000063), -- 레몬(거래가능)
  (65, 2, 6, 19, 2000064), -- 무화과(거래가능)
  (66, 2, 6, 20, 2000065), -- 야자(거래가능)
  (67, 2, 6, 21, 2000066), -- 올리브(거래가능)
  (68, 2, 6, 22, 2000067), -- 포도(거래가능)
  (69, 2, 6, 23, 2000068), -- 바나나(거래가능)
  (70, 2, 6, 24, 2000069), -- 오렌지(거래가능)
  (71, 2, 6, 25, 2000070), -- 버찌(거래가능)
  (72, 2, 6, 26, 2000071), -- 모링가나무 열매(거래가능)

  /* 향신료 (52) [게임플레이 - 캐릭터] */
  (73, 2, 4, 1, 2000072), -- 해바라기(거래가능)
  (74, 2, 4, 2, 2000073), -- 라벤더(거래가능)
  (75, 2, 4, 3, 2000074), -- 로즈마리(거래가능)
  (76, 2, 4, 4, 2000075), -- 바닐라(거래가능)
  (77, 2, 4, 5, 2000076), -- 창포(거래가능)
  (78, 2, 4, 6, 2000077), -- 양귀비(거래가능)
  (79, 2, 4, 7, 2000078), -- 후추(거래가능)
  (80, 2, 4, 8, 2000079), -- 박하(거래가능)
  (81, 2, 4, 9, 2000080), -- 강황(거래가능)
  (82, 2, 4, 10, 2000081), -- 샤프란(거래가능)

  /* 약재 (53) [게임플레이 - sub_menu_2_5] */
  (83, 2, 5, 1, 2000082), -- 벌꿀(거래가능)
  (84, 2, 5, 2, 2000083), -- 월계수잎(거래가능)
  (85, 2, 5, 3, 2000084), -- 장뇌삼(거래가능)
  (86, 2, 5, 4, 2000085), -- 버섯(거래가능)
  (87, 2, 5, 5, 2000086), -- 엉겅퀴(거래가능)
  (88, 2, 5, 6, 2000087), -- 산삼(거래가능)
  (89, 2, 5, 7, 2000088), -- 은행나뭇잎(거래가능)
  (90, 2, 5, 8, 2000089), -- 동충하초(거래가능)
  (91, 2, 5, 9, 2000090), -- 알로에(거래가능)

  /* 화초 (55) [게임플레이 - 캐릭터] */
  (92, 2, 4, 11, 2000091), -- 수레국화(거래가능)
  (93, 2, 4, 12, 2000092), -- 백합(거래가능)
  (94, 2, 4, 13, 2000093), -- 선인장(거래가능)
  (95, 2, 4, 14, 2000094), -- 수선화(거래가능)
  (96, 2, 4, 15, 2000095), -- 연꽃(거래가능)
  (97, 2, 4, 16, 2000096), -- 철쭉(거래가능)
  (98, 2, 4, 17, 2000097), -- 토끼풀(거래가능)
  (99, 2, 4, 18, 2000098), -- 장미(거래가능)

  /* 보석 (59) [게임플레이 - 편의] */
  (100, 2, 3, 1, 2000099), -- 흑진주(거래가능)
  (101, 2, 3, 2, 2000100), -- 햇빛 행운석(거래가능)
  (102, 2, 3, 3, 2000101), -- 달빛 행운석(거래가능)
  (103, 2, 3, 4, 2000102), -- 별빛 행운석(거래가능)
  (104, 2, 3, 5, 2000103), -- 다이아몬드(거래가능)
  (105, 2, 3, 6, 2000104), -- 루비(거래가능)
  (106, 2, 3, 7, 2000105), -- 사파이어(거래가능)
  (107, 2, 3, 8, 2000106), -- 자수정(거래가능)
  (108, 2, 3, 9, 2000107), -- 에메랄드(거래가능)
  (109, 2, 3, 10, 2000108), -- 진주(거래가능)
  (110, 2, 3, 11, 2000109), -- 토파즈(거래가능)

  /* 제작재료 (119) [게임플레이 - 소비] */
  (111, 2, 2, 1, 2000110), -- 새벽 호수빛 첨가제(거래가능)
  (112, 2, 2, 2, 2000111), -- 조각낸 채소(거래가능)
  (113, 2, 2, 3, 2000112), -- 농축된 과즙(거래가능)
  (114, 2, 2, 4, 2000113), -- 말린 화초(거래가능)
  (115, 2, 2, 5, 2000114), -- 다진 향신료(거래가능)
  (116, 2, 2, 6, 2000115), -- 곱게 빻은 곡물(거래가능)
  (117, 2, 2, 7, 2000116), -- 훈증시킨 약재(거래가능)
  (118, 2, 2, 8, 2000117), -- 손질된 고기(거래가능)
  (119, 2, 2, 9, 2000118), -- 안정된 흑탄 가루(거래가능)
  (120, 2, 2, 10, 2000119), -- 안정된 암염 조각(거래가능)
  (121, 2, 2, 11, 2000120), -- 안정된 심층수 결정(거래가능)
  (122, 2, 2, 12, 2000121), -- 안정된 용골 정수(거래가능)

  /* 주화 (138) [메인 - 전체] */
  (123, 1, 4, 20, 2000122), -- 델피나드의 별(거래불가)

  /* 강화 관련 [메인 - 전체] */
  (124, 1, 4, 10, 2000123), -- 인벤토리 확장 주문서(거래가능)
  (125, 1, 4, 11, 2000124), -- 빛나는 무기 강화 주문서(거래가능)
  (126, 1, 4, 12, 2000125), -- 빛나는 방어구 강화 주문서(거래가능)
  (127, 1, 4, 13, 2000126), -- 빛나는 장신구 강화 주문서(거래가능)
  (128, 1, 4, 14, 2000127), -- 화려한 강화 보조석(거래가능, 100% 하락감소)
  (129, 1, 4, 15, 2000128), --찬란한 마법 정육면체(거래가능, 재연마 ~ 114%)
  (130, 1, 4, 16, 2000129), -- 찬란한 무기 마법 정사면체(거래가능)
  (131, 1, 4, 17, 2000130), -- 찬란한 방어구 마법 정사면체(거래가능)
  (132, 1, 4, 18, 2000131), -- 빛나는 무기 강화 주문서(거래가능)
  (133, 1, 4, 19, 2000132), -- 빛나는 무기 강화 주문서(거래가능)

  /* 도핑 관련 [메인 - 전체] */
  (134, 1, 4, 1, 2000133), -- 신기루 금화교환권#11(거래불가, 상점 판매가 개당 42골드)
  (135, 1, 4, 2, 2000134), -- 황홀한 여명(거래가능, 노동력: 1000)
  (136, 1, 4, 3, 2000135), -- 생산의 결실(거래불가, 생활점수 3천)
  (137, 1, 4, 4, 2000136), -- 명예의 전당: 1급(거래불가, 명예점수 5만)
  (138, 1, 4, 5, 2000137), -- 우리만의 비밀(거래불가)
  (139, 1, 4, 6, 2000138), -- 운영자의 보상 물약(거래불가)
  (140, 1, 4, 7, 2000139), -- 전투 장인의 비법서(거래불가)
  (141, 1, 4, 8, 2000140), -- 전투 명인의 비법서(거래불가)
  (142, 1, 4, 9, 2000141), -- 생활 시간 감소 주문서(거래불가)

  /* 탈것(말, 기계, 날틀) 관련 [운송수단 - 전체] */
  (143, 3, 1, 1, 2000142), -- 일리르 제오노스(거래불가)
  (144, 3, 1, 2, 2000143), -- 천둥질주(거래불가)
  (145, 3, 1, 3, 2000144), -- 검은 화살(거래불가
  (146, 3, 1, 4, 2000145), -- 당근질주(거래불가)
  (147, 3, 1, 5, 2000146), -- 백야(거래불가)
  (148, 3, 1, 6, 2000147), -- 묵뢰(거래불가)
  (149, 3, 1, 7, 2000148), -- 탈 수 있는 젖소(거래불가)
  (150, 3, 1, 8, 2000149), -- 이지의 딸(거래불가)
  (151, 3, 1, 9, 2000150), -- 이지의 아들(거래불가)
  (152, 3, 1, 10, 2000151), -- 붉은 번개(거래불가)
  (153, 3, 1, 11, 2000152), -- 3세대 돌풍 소환 주문서(거래불가)
  (154, 3, 1, 12, 2000153), -- 밭으로 5호 소환 주문서(거래불가)
  (155, 3, 1, 13, 2000154), -- 붉은 혜성 3000 소환 주문서(거래불가)
  (156, 3, 1, 14, 2000155), -- 붉은 소 달구지 소환 주문서(거래불가)
  (157, 3, 1, 15, 2000156), -- 철갑 전차 소환 주문서(거래불가)
  (158, 3, 1, 16, 2000157), -- 이지 여신의 날틀(거래가능)
  (159, 3, 1, 17, 2000158), -- 붉은 용 날틀(거래가능)
  (160, 3, 1, 18, 2000159), -- 달빛 그림자 날틀(거래가능)
  (161, 3, 1, 19, 2000160), -- 뇌우 날틀(거래가능)
  (162, 3, 1, 20, 2000161), -- 자유의 날개(거래가능)
  (163, 3, 1, 21, 2000162), -- 날틀 친구: 나무늘보(거래불가)
  (164, 3, 1, 22, 2000163), -- 전설의 용날개(거래불가)

  /* 외형 관련 [외형 - 전체] */
  (165, 5, 1, 1, 2000164), -- 장비 외형변경 촉매제(거래가능)
  (166, 5, 1, 2, 2000165), -- 무한한 상상의 염료(거래가능)
  (167, 5, 1, 3, 2000166), -- 무한한 상상의 틀(거래가능)
  (168, 5, 1, 4, 2000167), -- [할로윈] 피의 연회복 꾸러미(거래가능)
  (169, 5, 1, 5, 2000168), -- 활기찬 야타 친구 꾸러미(거래가능)
  (170, 5, 1, 6, 2000169), -- 발랄한 야타 친구 꾸러미(거래가능)
  (171, 5, 1, 7, 2000170), -- 건강한 야타 해적 꾸러미(거래가능)
  (172, 5, 1, 8, 2000171), -- 귀여운 야타 해적 꾸러미(거래가능)
  (173, 5, 1, 9, 2000172), -- 베로에 옥좌 꾸러미(거래가능)
  (174, 5, 1, 10, 2000173), -- 열대 햇살 꾸러미(거래불가)
  (175, 5, 1, 11, 2000174), -- 명예 무기 꾸러미(거래불가)
  (176, 5, 1, 12, 2000175); -- 여신의 무기 상자(거래불가)

-- Dumping structure for table aaemu_game.ics_shop_items
DROP TABLE IF EXISTS `ics_shop_items`;
CREATE TABLE IF NOT EXISTS `ics_shop_items` (
  `shop_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'SKU item id',
  `display_item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Item who''s icon to use for displaying in the shop, leave 0 for first item in the group',
  `name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT 'Can be used to override the name in the shop',
  `limited_type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Enables limited stock mode if non-zero, Account(1), Chracter(2)',
  `limited_stock_max` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Number of items left in stock for this SKU if limited stock is enabled',
  `level_min` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Minimum level to buy the item (does not show on UI)',
  `level_max` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Maximum level to buy the item (does not show on UI)',
  `buy_restrict_type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Buy restriction rule, none (0), level (1) or quest(2)',
  `buy_restrict_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Level or QuestId for restrict rule',
  `is_sale` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `is_hidden` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `sale_start` datetime DEFAULT NULL COMMENT 'Limited sale start time',
  `sale_end` datetime DEFAULT NULL COMMENT 'Limited sale end time',
  `shop_buttons` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'All (0), NoCart (1), NoGift (2), OnlyBuy (3)',
  `remaining` int(11) NOT NULL DEFAULT '-1' COMMENT 'Number of items remaining, only for tab 1-1 (limited)',
  PRIMARY KEY (`shop_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2000176 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Possible Item listings that are for sale';

-- Dumping data for table aaemu_game.ics_shop_items
REPLACE INTO `ics_shop_items` (`shop_id`, `display_item_id`, `name`, `limited_type`, `limited_stock_max`, `level_min`, `level_max`, `buy_restrict_type`, `buy_restrict_id`, `is_sale`, `is_hidden`, `sale_start`, `sale_end`, `shop_buttons`, `remaining`) VALUES
  /* 건물 (6) */
  (2000000, 0, '도면: 양식장', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000001, 0, '도면: 초가지붕 농장', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000002, 0, '도면: 시원한 수상 주택', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000003, 0, '도면: 햇빛 호박머리 허수아비 텃밭', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000004, 0, '도면: 달빛 호박머리 허수아비 텃밭', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000005, 0, '도면: 별빛 호박머리 허수아비 텃밭', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000006, 0, '도면: 만남의 광장', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000007, 0, '도면: 호박머리 허수아비 원두막', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000008, 0, '도면: 호박머리 허수아비 텃밭', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000009, 0, '도면: 밀짚모자 허수아비 텃밭', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

  /* 고무 (31) */
  (2000010, 0, '천연 고무', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

  /* 광석 (38) */
  (2000011, 0, '철광석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000012, 0, '구리 광석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000013, 0, '은광석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000014, 0, '금광석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000015, 0, '아키움 광석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
  (2000016, 0, '별의 파편 조각', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

  /* 원목 (39) */
 	(2000017, 0, '통나무', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000018, 0, '벼락 맞은 나무', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 암석 (40) */
	(2000019, 0, '암석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 생가죽 (41) */
	(2000020, 0, '생가죽', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 섬유 (42) */
	(2000021, 0, '오리털', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000022, 0, '거위털', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000023, 0, '양털', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 고기 (45) */
	(2000024, 0, '닭고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000025, 0, '오리고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000026, 0, '거위고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000027, 0, '칠면조고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000028, 0, '돼지고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000029, 0, '소고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000030, 0, '양고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000031, 0, '염소고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000032, 0, '야타고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 수산물 (46) */
	(2000033, 0, '붉은색 산호초', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000034, 0, '녹색 산호초', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000035, 0, '사슴뿔형 산호초', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000036, 0, '주황색 산호 더미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000037, 0, '노란색 산호 더미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 곡물 (47) */
	(2000038, 0, '쌀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000039, 0, '귀리', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000040, 0, '땅콩', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000041, 0, '밀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000042, 0, '보리', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000043, 0, '옥수수', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000044, 0, '콩', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000045, 0, '호밀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 채소 (48) */
	(2000046, 0, '블루베리', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000047, 0, '감자', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000048, 0, '고구마', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000049, 0, '당근', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000050, 0, '마늘', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000051, 0, '딸기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000052, 0, '양파', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000053, 0, '오이', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000054, 0, '토마토', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000055, 0, '호박', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000056, 0, '고추', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 열매 (49) */
	(2000057, 0, '사과', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000058, 0, '석류', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000059, 0, '아보카도', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000060, 0, '너도밤나무 열매', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000061, 0, '대추야자', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000062, 0, '도토리', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000063, 0, '레몬', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000064, 0, '무화과', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000065, 0, '야자', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000066, 0, '올리브', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000067, 0, '포도', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000068, 0, '바나나', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000069, 0, '오렌지', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000070, 0, '버찌', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000071, 0, '모링가나무 열매', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 향신료 (52) */
	(2000072, 0, '해바라기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000073, 0, '라벤더', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000074, 0, '로즈마리', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000075, 0, '바닐라', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000076, 0, '창포', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000077, 0, '양귀비', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000078, 0, '후추', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000079, 0, '박하', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000080, 0, '강황', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000081, 0, '샤프란', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 약재 (53) */
	(2000082, 0, '벌꿀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000083, 0, '월계수잎', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000084, 0, '장뇌삼', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000085, 0, '버섯', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000086, 0, '엉겅퀴', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000087, 0, '산삼', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000088, 0, '은행나뭇잎', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000089, 0, '동충하초', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000090, 0, '알로에', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 화초 (55) */
	(2000091, 0, '수레국화', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000092, 0, '백합', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000093, 0, '선인장', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000094, 0, '수선화', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000095, 0, '연꽃', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000096, 0, '철쭉', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000097, 0, '토끼풀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000098, 0, '장미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 보석 (59) */
	(2000099, 0, '흑진주', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000100, 0, '햇빛 행운석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000101, 0, '달빛 행운석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000102, 0, '별빛 행운석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000103, 0, '다이아몬드', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000104, 0, '루비', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000105, 0, '사파이어', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000106, 0, '자수정', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000107, 0, '에메랄드', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000108, 0, '진주', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000109, 0, '토파즈', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 제작재료 (119) */
	(2000110, 0, '새벽 호수빛 첨가제', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000111, 0, '조각낸 채소', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000112, 0, '농축된 과즙', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000113, 0, '말린 화초', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000114, 0, '다진 향신료', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000115, 0, '곱게 빻은 곡물', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000116, 0, '훈증시킨 약재', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000117, 0, '손질된 고기', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000118, 0, '안정된 흑탄 가루', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000119, 0, '안정된 암염 조각', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000120, 0, '안정된 심층수 결정', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000121, 0, '안정된 용골 정수', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 주화 (138) */
	(2000122, 0, '금화교환권', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 강화 관련 */
	(2000123, 0, '인벤토리 확장 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000124, 0, '빛나는 무기 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000125, 0, '빛나는 방어구 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000126, 0, '빛나는 장신구 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000127, 0, '화려한 강화 보조석', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000128, 0, '찬란한 마법 정육면체', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000129, 0, '찬란한 무기 마법 정사면체', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000130, 0, '찬란한 방어구 마법 정사면체', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000131, 0, '빛나는 무기 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000132, 0, '빛나는 무기 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 도핑 관련 */
	(2000133, 0, '금화교환권', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000134, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000135, 0, '생산의 결실', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000136, 0, '명예의 전당: 1급', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000137, 0, '우리만의 비밀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000138, 0, '운영자의 보상 물약', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000139, 0, '전투 장인의 비법서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000140, 0, '전투 명인의 비법서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000141, 0, '생활 시간 감소 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 탈것(말, 기계, 날틀) 관련 */
	(2000142, 0, '일리르 제오노스', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000143, 0, '천둥질주', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000144, 0, '검은 화살', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000145, 0, '당근질주', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000146, 0, '백야', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000147, 0, '묵뢰', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000148, 0, '탈 수 있는 젖소', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000149, 0, '이지의 딸', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000150, 0, '이지의 아들', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000151, 0, '붉은 번개', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000152, 0, '3세대 돌풍 소환 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000153, 0, '밭으로 5호 소환 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000154, 0, '붉은 혜성 3000 소환 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000155, 0, '붉은 소 달구지 소환 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000156, 0, '철갑 전차 소환 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000157, 0, '이지 여신의 날틀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000158, 0, '붉은 용 날틀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000159, 0, '달빛 그림자 날틀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000160, 0, '뇌우 날틀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000161, 0, '자유의 날개', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000162, 0, '날틀 친구: 나무늘보', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000163, 0, '전설의 용날개', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),

	/* 외형 관련 */
	(2000164, 0, '장비 외형변경 촉매제', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000165, 0, '무한한 상상의 염료', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000166, 0, '무한한 상상의 틀', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000167, 0, '[할로윈] 피의 연회복 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000168, 0, '활기찬 야타 친구 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000169, 0, '발랄한 야타 친구 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000170, 0, '건강한 야타 해적 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000171, 0, '귀여운 야타 해적 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000172, 0, '베로에 옥좌 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000173, 0, '열대 햇살 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000174, 0, '명예 무기 꾸러미', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1),
	(2000175, 0, '여신의 무기 상자', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1);

-- Dumping structure for table aaemu_game.ics_skus
DROP TABLE IF EXISTS `ics_skus`;
CREATE TABLE IF NOT EXISTS `ics_skus` (
  `sku` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `shop_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Reference to the shop item',
  `position` int(10) NOT NULL DEFAULT '0' COMMENT 'Used for display order inside the item details',
  `item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Item that is for sale',
  `item_count` int(10) unsigned NOT NULL DEFAULT '1' COMMENT 'Number of items for this detail',
  `select_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `is_default` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Is this the default selection?',
  `event_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `event_end_date` datetime DEFAULT NULL,
  `currency` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Credits(0), AAPoints(1), Loyalty(2), Coins(3)',
  `price` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Price of the item',
  `discount_price` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Discounted price (this is used if set)',
  `bonus_item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Bonus item included for this purchase',
  `bonus_item_count` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Amount of bonus items included',
  PRIMARY KEY (`sku`)
) ENGINE=InnoDB AUTO_INCREMENT=1000176 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Has the actual sales items for the details';

-- Dumping data for table aaemu_game.ics_skus
REPLACE INTO `ics_skus` (`sku`, `shop_id`, `position`, `item_id`, `item_count`, `select_type`, `is_default`, `event_type`, `event_end_date`, `currency`, `price`, `discount_price`, `bonus_item_id`, `bonus_item_count`) VALUES
	/* 건물 (6) */
	(1000000, 2000000, 0, 18664, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 양식장(거래가능)
	(1000001, 2000001, 0, 21165, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 초가지붕 농장(거래가능)
	(1000002, 2000002, 0, 27687, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 시원한 수상 주택(거래가능)
	(1000003, 2000003, 0, 30013, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 햇빛 호박머리 허수아비 텃밭(거래가능)
	(1000004, 2000004, 0, 30014, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 달빛 호박머리 허수아비 텃밭(거래가능)
	(1000005, 2000005, 0, 30015, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 별빛 호박머리 허수아비 텃밭(거래가능)
	(1000006, 2000006, 0, 31924, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 만남의 광장(거래가능)
	(1000007, 2000007, 0, 34438, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 호박머리 허수아비 원두막(거래가능)
	(1000008, 2000008, 0, 15566, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 호박머리 허수아비 텃밭(거래가능)
	(1000009, 2000009, 0, 15596, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 밀짚모자 허수아비 텃밭(거래가능)

	/* 고무 (31) */
	(1000010, 2000010, 0, 15730, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 천연 고무(거래가능)

	/* 광석 (38) */
	(1000011, 2000011, 0, 8022, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철광석(거래가능)
	(1000012, 2000012, 0, 3411, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 구리 광석(거래가능)
	(1000013, 2000013, 0, 8023, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 은광석(거래가능)
	(1000014, 2000014, 0, 8027, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 금광석(거래가능)
	(1000015, 2000015, 0, 1386, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 아키움 광석(거래가능)
	(1000016, 2000016, 0, 2201, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 별의 파편 조각(거래가능)

	/* 원목 (39) */
	(1000017, 2000017, 0, 8017, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 통나무(거래가능)
	(1000018, 2000018, 0, 15709, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 벼락 맞은 나무(거래가능)

	/* 암석 (40) */
	(1000019, 2000019, 0, 8008, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 암석(거래가능)

	/* 생가죽 (41) */
	(1000020, 2000020, 0, 8007, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생가죽(거래가능)

	/* 섬유 (42) */
  (1000021, 2000021, 0, 19946, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오리털(거래가능)
  (1000022, 2000022, 0, 19947, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 거위털(거래가능)
  (1000023, 2000023, 0, 8053, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양털(거래가능)

  /* 고기 (45) */
  (1000024, 2000024, 0, 3507, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 닭고기(거래가능)
  (1000025, 2000025, 0, 3515, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오리고기(거래가능)
  (1000026, 2000026, 0, 19944, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 거위고기(거래가능)
  (1000027, 2000027, 0, 19945, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 칠면조 고기(거래가능)
  (1000028, 2000028, 0, 7747, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 돼지고기(거래가능)
  (1000029, 2000029, 0, 8048, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 소고기(거래가능)
  (1000030, 2000030, 0, 8052, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양고기(거래가능)
  (1000031, 2000031, 0, 16221, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 염소고기(거래가능)
  (1000032, 2000032, 0, 26673, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 야타 고기(거래가능)

  /* 수산물 (46) */
  (1000033, 2000033, 0, 18936, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은색 산호초(거래가능)
  (1000034, 2000034, 0, 18937, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 녹색 산호초(거래가능)
  (1000035, 2000035, 0, 18938, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사슴뿔형 산호초(거래가능)
  (1000036, 2000036, 0, 18942, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 주황색 산호 더미(거래가능)
  (1000037, 2000037, 0, 18943, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 노란색 산호 더미(거래가능)

  /* 곡물 (47) */
  (1000038, 2000038, 0, 784, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 쌀(거래가능)
  (1000039, 2000039, 0, 3545, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 귀리(거래가능)
  (1000040, 2000040, 0, 8000, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 땅콩(거래가능)
  (1000041, 2000041, 0, 8004, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 밀(거래가능)
  (1000042, 2000042, 0, 8005, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 보리(거래가능)
  (1000043, 2000043, 0, 8013, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 옥수수(거래가능)
  (1000044, 2000044, 0, 8015, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 콩(거래가능)
  (1000045, 2000045, 0, 14971, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 호밀(거래가능)

  /* 채소 (48) */
  (1000046, 2000046, 0, 3583, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 블루베리(거래가능)
  (1000047, 2000047, 0, 7992, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 감자(거래가능)
  (1000048, 2000048, 0, 7994, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 고구마(거래가능)
  (1000049, 2000049, 0, 7998, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 당근(거래가능)
  (1000050, 2000050, 0, 8001, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 마늘(거래가능)
  (1000051, 2000051, 0, 8006, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 딸기(거래가능)
  (1000052, 2000052, 0, 8010, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양파(거래가능)
  (1000053, 2000053, 0, 8012, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오이(거래가능)
  (1000054, 2000054, 0, 8016, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토마토(거래가능)
  (1000055, 2000055, 0, 8018, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 호박(거래가능)
  (1000056, 2000056, 0, 16276, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 고추(거래가능)

  /* 열매 (49) */
  (1000057, 2000057, 0, 773, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사과(거래가능)
  (1000058, 2000058, 0, 3588, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 석류(거래가능)
  (1000059, 2000059, 0, 3592, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 아보카도(거래가능)
  (1000060, 2000060, 0, 8028, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 너도밤나무 열매(거래가능)
  (1000061, 2000061, 0, 8034, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 대추야자(거래가능)
  (1000062, 2000062, 0, 8035, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도토리(거래가능)
  (1000063, 2000063, 0, 8036, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 레몬(거래가능)
  (1000064, 2000064, 0, 8038, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무화과(거래가능)
  (1000065, 2000065, 0, 8050, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 야자(거래가능)
  (1000066, 2000066, 0, 8054, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 올리브(거래가능)
  (1000067, 2000067, 0, 8065, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 포도(거래가능)
  (1000068, 2000068, 0, 14620, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 바나나(거래가능)
  (1000069, 2000069, 0, 14621, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오렌지(거래가능)
  (1000070, 2000070, 0, 14627, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 버찌(거래가능)
  (1000071, 2000071, 0, 15770, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 모링가나무 열매(거래가능)

  /* 향신료 (52) */
  (1000072, 2000072, 0, 3622, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 해바라기(거래가능)
  (1000073, 2000073, 0, 3627, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 라벤더(거래가능)
  (1000074, 2000074, 0, 3628, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 로즈마리(거래가능)
  (1000075, 2000075, 0, 3630, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 바닐라(거래가능)
  (1000076, 2000076, 0, 3713, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 창포(거래가능)
  (1000077, 2000077, 0, 8009, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양귀비(거래가능)
  (1000078, 2000078, 0, 8019, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 후추(거래가능)
  (1000079, 2000079, 0, 14629, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 박하(거래가능)
  (1000080, 2000080, 0, 16268, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 강황(거래가능)
  (1000081, 2000081, 0, 16273, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 샤프란(거래가능)

  /* 약재 (53) */
  (1000082, 2000082, 0, 28481, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 벌꿀(거래가능)
  (1000083, 2000083, 0, 3675, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 월계수잎(거래가능)
  (1000084, 2000084, 0, 3680, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장뇌삼(거래가능)
  (1000085, 2000085, 0, 14630, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 버섯(거래가능)
  (1000086, 2000086, 0, 14631, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 엉겅퀴(거래가능)
  (1000087, 2000087, 0, 14632, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 산삼(거래가능)
  (1000088, 2000088, 0, 15767, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 은행나뭇잎(거래가능)
  (1000089, 2000089, 0, 16284, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 동충하초(거래가능)
  (1000090, 2000090, 0, 16290, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 알로에(거래가능)

  /* 화초 (55) */
  (1000091, 2000091, 0, 2178, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 수레국화(거래가능)
  (1000092, 2000092, 0, 3564, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 백합(거래가능)
  (1000093, 2000093, 0, 3659, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 선인장(거래가능)
  (1000094, 2000094, 0, 3667, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 수선화(거래가능)
  (1000095, 2000095, 0, 3671, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 연꽃(거래가능)
  (1000096, 2000096, 0, 3684, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철쭉(거래가능)
  (1000097, 2000097, 0, 3685, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토끼풀(거래가능)
  (1000098, 2000098, 0, 3711, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장미(거래가능)

  /* 보석 (59) */
  (1000099, 2000099, 0, 19045, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 흑진주(거래가능)
  (1000100, 2000100, 0, 28300, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 햇빛 행운석(거래가능)
  (1000101, 2000101, 0, 28308, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 달빛 행운석(거래가능)
  (1000102, 2000102, 0, 31930, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 별빛 행운석(거래가능)
  (1000103, 2000103, 0, 8076, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 다이아몬드(거래가능)
  (1000104, 2000104, 0, 8077, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 루비(거래가능)
  (1000105, 2000105, 0, 8078, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사파이어(거래가능)
  (1000106, 2000106, 0, 8079, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 자수정(거래가능)
  (1000107, 2000107, 0, 8082, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 에메랄드(거래가능)
  (1000108, 2000108, 0, 8083, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 진주(거래가능)
  (1000109, 2000109, 0, 8084, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토파즈(거래가능)

  /* 제작재료 (119) */
  (1000110, 2000110, 0, 28175, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 새벽 호수빛 첨가제(거래가능)
  (1000111, 2000111, 0, 30898, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 조각낸 채소(거래가능)
  (1000112, 2000112, 0, 30899, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 농축된 과즙(거래가능)
  (1000113, 2000113, 0, 30900, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 말린 화초(거래가능)
  (1000114, 2000114, 0, 30901, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 다진 향신료(거래가능)
  (1000115, 2000115, 0, 30902, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 곱게 빻은 곡물(거래가능)
  (1000116, 2000116, 0, 30903, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 훈증시킨 약재(거래가능)
  (1000117, 2000117, 0, 30905, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 손질된 고기(거래가능)
  (1000118, 2000118, 0, 32103, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 흑탄 가루(거래가능)
  (1000119, 2000119, 0, 32104, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 암염 조각(거래가능)
  (1000120, 2000120, 0, 32105, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 심층수 결정(거래가능)
  (1000121, 2000121, 0, 32106, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 용골 정수(거래가능)

  /* 주화 (138) */
  (1000122, 2000122, 0, 23633, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 델피나드의 별(거래불가)

  /* 강화 관련 */
  (1000123, 2000123, 0, 8000025, 50, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 인벤토리 확장 주문서(거래가능)
 	(1000124, 2000124, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)
	(1000125, 2000125, 0, 28297, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 방어구 강화 주문서(거래가능)
	(1000126, 2000126, 0, 31927, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 장신구 강화 주문서(거래가능)
	(1000127, 2000127, 0, 31981, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 화려한 강화 보조석(거래가능, 100% 하락감소)
	(1000128, 2000128, 0, 34316, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 마법 정육면체(거래가능, 재연마 ~ 114%)
	(1000129, 2000129, 0, 32946, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 무기 마법 정사면체(거래가능, 재연마 초기화)
	(1000130, 2000130, 0, 33260, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 방어구 마법 정사면체(거래가능, 재연마 초기화)
	(1000131, 2000131, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)
	(1000132, 2000132, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)

	/* 도핑 관련 */
	(1000133, 2000133, 0, 31739, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 신기루 금화교환권#11(거래불가, 상점 판매가 개당 42골드)
	(1000134, 2000134, 0, 31145, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 황홀한 여명(거래가능, 노동력: 1000)
	(1000135, 2000135, 0, 29052, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생산의 결실(거래불가, 생활점수 3천)
	(1000136, 2000136, 0, 30538, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 명예의 전당: 1급(거래불가, 명예점수 5만)
	(1000137, 2000137, 0, 34143, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 우리만의 비밀(거래불가)
	(1000138, 2000138, 0, 34721, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 운영자의 보상 물약(거래불가)
	(1000139, 2000139, 0, 34019, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전투 장인의 비법서(거래불가)
	(1000140, 2000140, 0, 34020, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전투 명인의 비법서(거래불가)
	(1000141, 2000141, 0, 34819, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생활 시간 감소 주문서(거래불가)

  /* 탈것(말, 기계, 날틀) 관련 */
 	(1000142, 2000142, 0, 26427, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 일리르 제오노스(거래불가)
  (1000143, 2000143, 0, 28087, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 천둥질주(거래불가)
  (1000144, 2000144, 0, 28138, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 검은 화살(거래불가)
  (1000145, 2000145, 0, 28638, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 당근질주(거래불가)
  (1000146, 2000146, 0, 28736, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 백야(거래불가)
  (1000147, 2000147, 0, 30209, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 묵뢰(거래불가)
  (1000148, 2000148, 0, 19604, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 탈 수 있는 젖소(거래불가)
  (1000149, 2000149, 0, 30878, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지의 딸(거래불가)
  (1000150, 2000150, 0, 30879, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지의 아들(거래불가)
  (1000151, 2000151, 0, 32566, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 번개(거래불가)
  (1000152, 2000152, 0, 29869, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 3세대 돌풍 소환 주문서(거래불가)
  (1000153, 2000153, 0, 29870, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 밭으로 5호 소환 주문서(거래불가)
  (1000154, 2000154, 0, 29871, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 혜성 3000 소환 주문서(거래불가)
  (1000155, 2000155, 0, 34314, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 소 달구지 소환 주문서(거래불가)
  (1000156, 2000156, 0, 16262, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철갑 전차 소환 주문서(거래불가)
  (1000157, 2000157, 0, 18174, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지 여신의 날틀(거래가능)
  (1000158, 2000158, 0, 18175, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 용 날틀(거래가능)
  (1000159, 2000159, 0, 23612, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 달빛 그림자 날틀(거래가능)
  (1000160, 2000160, 0, 23613, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 뇌우 날틀(거래가능)
  (1000161, 2000161, 0, 29199, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 자유의 날개(거래가능)
  (1000162, 2000162, 0, 30621, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 날틀 친구: 나무늘보(거래불가)
  (1000163, 2000163, 0, 29039, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전설의 용날개(거래불가)

	/* 외형 관련 */
	(1000164, 2000164, 0, 29880, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장비 외형변경 촉매제(거래가능)
	(1000165, 2000165, 0, 17662, 10, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무한한 상상의 염료(거래가능)
	(1000166, 2000166, 0, 17663, 10, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무한한 상상의 틀(거래가능)
	(1000167, 2000167, 0, 30599, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- [할로윈] 피의 연회복 꾸러미(거래가능)
	(1000168, 2000168, 0, 30753, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 활기찬 야타 친구 꾸러미(거래가능)
	(1000169, 2000169, 0, 30754, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 발랄한 야타 친구 꾸러미(거래가능)
	(1000170, 2000170, 0, 30755, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 건강한 야타 해적 꾸러미(거래가능)
	(1000171, 2000171, 0, 30756, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 귀여운 야타 해적 꾸러미(거래가능)
	(1000172, 2000172, 0, 31152, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 베로에 옥좌 꾸러미(거래가능)
	(1000173, 2000173, 0, 31825, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 열대 햇살 꾸러미(거래불가)
	(1000174, 2000174, 0, 31989, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 명예 무기 꾸러미(거래불가)
	(1000175, 2000175, 0, 34262, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0); -- 여신의 무기 상자(거래불가)

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
