-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               8.0.12 - MySQL Community Server - GPL
-- Server OS:                    Linux
-- HeidiSQL Version:             12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

/*
루루의 상점에서 등록할 탭 위치 및 정렬 위치 값 설정
[main_tab] 메인 탭으로 아래와 같은 이름으로 분류됨.
메인(id: 1), 게임플레이(id: 2), 운송수단(id: 3), 하우징(id: 4), 외형(id: 5), 루루딱지(id: 6)

[sub_tab] 서브 탭으로 메인 탭별로 아래와 같은 이름으로 분류됨.
메인 [한정판매(id: 1), 추천(id: 2), 신규(id: 3), 전체(id: 4), sub_menu_1_5(id: 5), sub_menu_1_6(id: 6), sub_menu_1_7(id: 7)]
게임플레이 [전체(id: 1), 소비(id: 2), 편의(id: 3), 캐릭터(id: 4), sub_menu_2_5(id: 5), sub_menu_2_6(id: 6), 기타(id: 7)]
운송수단 [전체(id: 1), 날틀(id: 2), 소환수(id: 3), sub_menu_3_4(id: 4), sub_menu_3_5(id: 5), sub_menu_3_6(id: 6), sub_menu_3_7(id: 7)]
하우징 [전체(id: 1), 소유지(id: 2), 가구(id: 3), sub_menu_4_4(id: 4), sub_menu_4_5(id: 5), sub_menu_4_6(id: 6), 기타(id: 7)]
외형 [전체(id: 1), 소비(id: 2), 코스튬(id: 3), UCC아이템(id: 4), sub_menu_5_5(id: 5), sub_menu_5_6(id: 6), sub_menu_5_7(id: 7)]
루루딱지 [전체(id: 1), 아이템(id: 2), 소비(id: 3), 외형(id: 4), 펫(id: 5), sub_menu_6_6(id: 6), 기타(id: 7)]

[tab_pos] 각 속한 탭에서 순서 값

[shop_id] 상품 묶음 유니크 값
*/

-- Dumping structure for table aaemu_game.ics_menu
DROP TABLE IF EXISTS `ics_menu`;
CREATE TABLE IF NOT EXISTS `ics_menu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `main_tab` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT 'Which main tab to display on',
  `sub_tab` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT 'Which sub tab to display on',
  `tab_pos` int(11) NOT NULL DEFAULT '0' COMMENT 'Used to change display order',
  `shop_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'Id of the item group for sale (shop item)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Contains what item will be displayed on which tab';

-- Dumping data for table aaemu_game.ics_menu: ~2 rows (approximately)
REPLACE INTO `ics_menu` (`id`, `main_tab`, `sub_tab`, `tab_pos`, `shop_id`) VALUES
	(1, 1, 2, 1, 2000000), -- 황홀한 여명(노동력: 1000, 거래가능)
	(2, 1, 2, 2, 2000001), -- 신기루 금화교환권#11(상점 판매가 개당 42골드, 거래불가)
	(3, 1, 2, 3, 2000002), -- 빛나는 무기 강화 주문서(거래가능)
	(4, 1, 2, 4, 2000003), -- 빛나는 방어구 강화 주문서(거래가능)
	(5, 1, 2, 5, 2000004); -- 빛나는 장신구 강화 주문서(거래가능)

-- Dumping structure for table aaemu_game.ics_shop_items
DROP TABLE IF EXISTS `ics_shop_items`;
CREATE TABLE IF NOT EXISTS `ics_shop_items` (
  `shop_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'SKU item id',
  `display_item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Item who''s icon to use for displaying in the shop, leave 0 for first item in the group',
  `name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT 'Can be used to override the name in the shop',
  `limited_type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Enables limited stock mode if non-zero, Account(1), Chracter(2)',
  `limited_stock_max` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Number of items left in stock for this SKU if limited stock is enabled',
  `level_min` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Minimum level to buy the item (does not show on UI)',
  `level_max` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Maximum level to buy the item (does not show on UI)',
  `buy_restrict_type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Buy restriction rule, none (0), level (1) or quest(2)',
  `buy_restrict_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Level or QuestId for restrict rule',
  `is_sale` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `is_hidden` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `sale_start` datetime DEFAULT NULL COMMENT 'Limited sale start time',
  `sale_end` datetime DEFAULT NULL COMMENT 'Limited sale end time',
  `shop_buttons` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'All (0), NoCart (1), NoGift (2), OnlyBuy (3)',
  `remaining` int(11) NOT NULL DEFAULT '-1' COMMENT 'Number of items remaining, only for tab 1-1 (limited)',
  PRIMARY KEY (`shop_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2000005 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Possible Item listings that are for sale';

-- Dumping data for table aaemu_game.ics_shop_items: ~2 rows (approximately)
REPLACE INTO `ics_shop_items` (`shop_id`, `display_item_id`, `name`, `limited_type`, `limited_stock_max`, `level_min`, `level_max`, `buy_restrict_type`, `buy_restrict_id`, `is_sale`, `is_hidden`, `sale_start`, `sale_end`, `shop_buttons`, `remaining`) VALUES
  /* 건물 (6) */
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)
  (2000000, 0, '황홀한 여명', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 황홀한 여명(노동력: 1000, 거래가능)

	(2000001, 0, '금화교환권', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 신기루 금화교환권#11(상점 판매가 개당 42골드, 거래불가)
	(2000002, 0, '빛나는 무기 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 빛나는 무기 강화 주문서(거래가능)
	(2000003, 0, '빛나는 방어구 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1), -- 빛나는 방어구 강화 주문서(거래가능)
	(2000004, 0, '빛나는 장신구 강화 주문서', 0, 0, 0, 0, 0, 0, 0, 0, NULL, NULL, 0, -1); -- 빛나는 장신구 강화 주문서(거래가능)

-- Dumping structure for table aaemu_game.ics_skus
DROP TABLE IF EXISTS `ics_skus`;
CREATE TABLE IF NOT EXISTS `ics_skus` (
  `sku` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `shop_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Reference to the shop item',
  `position` int(10) NOT NULL DEFAULT '0' COMMENT 'Used for display order inside the item details',
  `item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Item that is for sale',
  `item_count` int(10) unsigned NOT NULL DEFAULT '1' COMMENT 'Number of items for this detail',
  `select_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `is_default` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Is this the default selection?',
  `event_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `event_end_date` datetime DEFAULT NULL,
  `currency` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT 'Credits(0), AAPoints(1), Loyalty(2), Coins(3)',
  `price` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Price of the item',
  `discount_price` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Discounted price (this is used if set)',
  `bonus_item_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Bonus item included for this purchase',
  `bonus_item_count` int(10) unsigned NOT NULL DEFAULT '0' COMMENT 'Amount of bonus items included',
  PRIMARY KEY (`sku`)
) ENGINE=InnoDB AUTO_INCREMENT=2000179 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Has the actual sales items for the details';

-- Dumping data for table aaemu_game.ics_skus: ~2 rows (approximately)
REPLACE INTO `ics_skus` (`sku`, `shop_id`, `position`, `item_id`, `item_count`, `select_type`, `is_default`, `event_type`, `event_end_date`, `currency`, `price`, `discount_price`, `bonus_item_id`, `bonus_item_count`) VALUES
	/* 건물 (6) */
	(1000000, 2000000, 0, 18664, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 양식장(거래가능)
	(1000001, 2000001, 0, 21165, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 초가지붕 농장(거래가능)
	(1000002, 2000002, 0, 27687, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 시원한 수상 주택(거래가능)
	(1000003, 2000003, 0, 30013, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 햇빛 호박머리 허수아비 텃밭(거래가능)
	(1000004, 2000004, 0, 30014, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 달빛 호박머리 허수아비 텃밭(거래가능)
	(1000005, 2000005, 0, 30015, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 별빛 호박머리 허수아비 텃밭(거래가능)
	(1000006, 2000006, 0, 31924, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 만남의 광장(거래가능)
	(1000007, 2000007, 0, 34438, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 호박머리 허수아비 원두막(거래가능)
	(1000008, 2000008, 0, 15566, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 호박머리 허수아비 텃밭(거래가능)
	(1000009, 2000009, 0, 15596, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도면: 밀짚모자 허수아비 텃밭(거래가능)

	/* 고무 (31) */
	(1000010, 2000010, 0, 15730, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 천연 고무(거래가능)

	/* 광석 (38) */
	(1000011, 2000011, 0, 8022, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철광석(거래가능)
	(1000012, 2000012, 0, 3411, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 구리 광석(거래가능)
	(1000013, 2000013, 0, 8023, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 은광석(거래가능)
	(1000014, 2000014, 0, 8027, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 금광석(거래가능)
	(1000015, 2000015, 0, 1386, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 아키움 광석(거래가능)
	(1000016, 2000016, 0, 2201, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 별의 파편 조각(거래가능)

	/* 원목 (39) */
	(1000017, 2000017, 0, 8017, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 통나무(거래가능)
	(1000018, 2000018, 0, 15709, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 벼락 맞은 나무(거래가능)

	/* 암석 (40) */
	(1000019, 2000019, 0, 8008, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 암석(거래가능)

	/* 생가죽 (41) */
	(1000020, 2000020, 0, 8007, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생가죽(거래가능)

	/* 섬유 (42) */
  (1000021, 2000021, 0, 19946, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오리털(거래가능)
  (1000022, 2000022, 0, 19947, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 거위털(거래가능)
  (1000023, 2000023, 0, 8053, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양털(거래가능)

  /* 고기 (45) */
  (1000024, 2000024, 0, 3507, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 닭고기(거래가능)
  (1000025, 2000025, 0, 3515, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오리고기(거래가능)
  (1000026, 2000026, 0, 19944, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 거위고기(거래가능)
  (1000027, 2000027, 0, 19945, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 칠면조 고기(거래가능)
  (1000028, 2000028, 0, 7747, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 돼지고기(거래가능)
  (1000029, 2000029, 0, 8048, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 소고기(거래가능)
  (1000030, 2000030, 0, 8052, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양고기(거래가능)
  (1000031, 2000031, 0, 16221, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 염소고기(거래가능)
  (1000032, 2000032, 0, 26673, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 야타 고기(거래가능)

  /* 수산물 (46) */
  (1000033, 2000033, 0, 18936, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은색 산호초(거래가능)
  (1000034, 2000034, 0, 18937, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 녹색 산호초(거래가능)
  (1000035, 2000035, 0, 18938, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사슴뿔형 산호초(거래가능)
  (1000036, 2000036, 0, 18942, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 주황색 산호 더미(거래가능)
  (1000037, 2000037, 0, 18943, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 노란색 산호 더미(거래가능)

  /* 곡물 (47) */
  (1000038, 2000038, 0, 784, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 쌀(거래가능)
  (1000039, 2000039, 0, 3545, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 귀리(거래가능)
  (1000040, 2000040, 0, 8000, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 땅콩(거래가능)
  (1000041, 2000041, 0, 8004, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 밀(거래가능)
  (1000042, 2000042, 0, 8005, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 보리(거래가능)
  (1000043, 2000043, 0, 8013, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 옥수수(거래가능)
  (1000044, 2000044, 0, 8015, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 콩(거래가능)
  (1000045, 2000045, 0, 14971, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 호밀(거래가능)

  /* 채소 (48) */
  (1000046, 2000046, 0, 3583, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 블루베리(거래가능)
  (1000047, 2000047, 0, 7992, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 감자(거래가능)
  (1000048, 2000048, 0, 7994, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 고구마(거래가능)
  (1000049, 2000049, 0, 7998, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 당근(거래가능)
  (1000050, 2000050, 0, 8001, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 마늘(거래가능)
  (1000051, 2000051, 0, 8006, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 딸기(거래가능)
  (1000052, 2000052, 0, 8010, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양파(거래가능)
  (1000053, 2000053, 0, 8012, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오이(거래가능)
  (1000054, 2000054, 0, 8016, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토마토(거래가능)
  (1000055, 2000055, 0, 8018, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 호박(거래가능)
  (1000056, 2000056, 0, 16276, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 고추(거래가능)

  /* 열매 (49) */
  (1000057, 2000057, 0, 773, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사과(거래가능)
  (1000058, 2000058, 0, 3588, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 석류(거래가능)
  (1000059, 2000059, 0, 3592, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 아보카도(거래가능)
  (1000060, 2000060, 0, 8028, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 너도밤나무 열매(거래가능)
  (1000061, 2000061, 0, 8034, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 대추야자(거래가능)
  (1000062, 2000062, 0, 8035, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 도토리(거래가능)
  (1000063, 2000063, 0, 8036, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 레몬(거래가능)
  (1000064, 2000064, 0, 8038, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무화과(거래가능)
  (1000065, 2000065, 0, 8050, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 야자(거래가능)
  (1000066, 2000066, 0, 8054, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 올리브(거래가능)
  (1000067, 2000067, 0, 8065, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 포도(거래가능)
  (1000068, 2000068, 0, 14620, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 바나나(거래가능)
  (1000069, 2000069, 0, 14621, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 오렌지(거래가능)
  (1000070, 2000070, 0, 14627, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 버찌(거래가능)
  (1000071, 2000071, 0, 15770, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 모링가나무 열매(거래가능)

  /* 향신료 (52) */
  (1000072, 2000072, 0, 3622, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 해바라기(거래가능)
  (1000073, 2000073, 0, 3627, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 라벤더(거래가능)
  (1000074, 2000074, 0, 3628, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 로즈마리(거래가능)
  (1000075, 2000075, 0, 3630, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 바닐라(거래가능)
  (1000076, 2000076, 0, 3713, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 창포(거래가능)
  (1000077, 2000077, 0, 8009, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 양귀비(거래가능)
  (1000078, 2000078, 0, 8019, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 후추(거래가능)
  (1000079, 2000079, 0, 14629, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 박하(거래가능)
  (1000080, 2000080, 0, 16268, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 강황(거래가능)
  (1000081, 2000081, 0, 16273, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 샤프란(거래가능)

  /* 약재 (53) */
  (1000082, 2000082, 0, 28481, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 벌꿀(거래가능)
  (1000083, 2000083, 0, 3675, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 월계수잎(거래가능)
  (1000084, 2000084, 0, 3680, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장뇌삼(거래가능)
  (1000085, 2000085, 0, 14630, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 버섯(거래가능)
  (1000086, 2000086, 0, 14631, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 엉겅퀴(거래가능)
  (1000087, 2000087, 0, 14632, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 산삼(거래가능)
  (1000088, 2000088, 0, 15767, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 은행나뭇잎(거래가능)
  (1000089, 2000089, 0, 16284, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 동충하초(거래가능)
  (1000090, 2000090, 0, 16290, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 알로에(거래가능)

  /* 화초 (55) */
  (1000091, 2000091, 0, 2178, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 수레국화(거래가능)
  (1000092, 2000092, 0, 3564, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 백합(거래가능)
  (1000093, 2000093, 0, 3659, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 선인장(거래가능)
  (1000094, 2000094, 0, 3667, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 수선화(거래가능)
  (1000095, 2000095, 0, 3671, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 연꽃(거래가능)
  (1000096, 2000096, 0, 3684, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철쭉(거래가능)
  (1000097, 2000097, 0, 3685, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토끼풀(거래가능)
  (1000098, 2000098, 0, 3711, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장미(거래가능)

  /* 보석 (59) */
  (1000099, 2000099, 0, 19045, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 흑진주(거래가능)
  (1000100, 2000100, 0, 28300, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 햇빛 행운석(거래가능)
  (1000101, 2000101, 0, 28308, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 달빛 행운석(거래가능)
  (1000102, 2000102, 0, 31930, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 별빛 행운석(거래가능)
  (1000103, 2000103, 0, 8076, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 다이아몬드(거래가능)
  (1000104, 2000104, 0, 8077, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 루비(거래가능)
  (1000105, 2000105, 0, 8078, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 사파이어(거래가능)
  (1000106, 2000106, 0, 8079, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 자수정(거래가능)
  (1000107, 2000107, 0, 8082, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 에메랄드(거래가능)
  (1000108, 2000108, 0, 8083, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 진주(거래가능)
  (1000109, 2000109, 0, 8084, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토파즈(거래가능)

  /* 제작재료 (119) */
  (1000110, 2000110, 0, 28175, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 새벽 호수빛 첨가제(거래가능)
  (1000111, 2000111, 0, 30898, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 조각낸 채소(거래가능)
  (1000112, 2000112, 0, 30899, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 농축된 과즙(거래가능)
  (1000113, 2000113, 0, 30900, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 말린 화초(거래가능)
  (1000114, 2000114, 0, 30901, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 다진 향신료(거래가능)
  (1000115, 2000115, 0, 30902, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 곱게 빻은 곡물(거래가능)
  (1000116, 2000116, 0, 30903, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 훈증시킨 약재(거래가능)
  (1000117, 2000117, 0, 30905, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 손질된 고기(거래가능)
  (1000118, 2000118, 0, 32103, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 흑탄 가루(거래가능)
  (1000119, 2000119, 0, 32104, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 암염 조각(거래가능)
  (1000120, 2000120, 0, 32105, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 심층수 결정(거래가능)
  (1000121, 2000121, 0, 32106, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 안정된 용골 정수(거래가능)
  (1000122, 2000122, 0, 8084, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토파즈(거래가능)
  (1000123, 2000123, 0, 8084, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 토파즈(거래가능)

  /* 주화 (138) */
  (1000124, 2000124, 0, 23633, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 델피나드의 별(거래불가)

  /* 강화 관련 */
  (1000125, 2000125, 0, 8000025, 50, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 인벤토리 확장 주문서(거래가능)
 	(1000126, 2000126, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)
	(1000127, 2000127, 0, 28297, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 방어구 강화 주문서(거래가능)
	(1000128, 2000128, 0, 31927, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 장신구 강화 주문서(거래가능)
	(1000129, 2000129, 0, 31981, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 화려한 강화 보조석(100% 하락감소, 거래가능)
	(1000130, 2000130, 0, 34316, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 마법 정육면체(거래가능, 재연마 ~ 114%)
	(1000131, 2000131, 0, 32946, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 무기 마법 정사면체(거래가능, 재연마 초기화)
	(1000132, 2000132, 0, 33260, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 찬란한 방어구 마법 정사면체(거래가능, 재연마 초기화)
	(1000133, 2000133, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)
	(1000134, 2000134, 0, 28296, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 빛나는 무기 강화 주문서(거래가능)

	/* 도핑 관련 */
	(1000135, 2000135, 0, 31739, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 신기루 금화교환권#11(상점 판매가 개당 42골드, 거래불가)
	(1000136, 2000136, 0, 31145, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 황홀한 여명(거래가능, 노동력: 1000)
	(1000137, 2000137, 0, 29052, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생산의 결실(거래불가, 생활점수 3천)
	(1000138, 2000138, 0, 30538, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 명예의 전당: 1급(거래불가, 명예점수 5만)
	(1000139, 2000139, 0, 34143, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 우리만의 비밀(거래불가)
	(1000140, 2000140, 0, 34721, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 운영자의 보상 물약(거래불가)
	(1000141, 2000141, 0, 34019, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전투 장인의 비법서(거래불가)
	(1000142, 2000142, 0, 34020, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전투 명인의 비법서(거래불가)
	(1000143, 2000143, 0, 34819, 100, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 생활 시간 감소 주문서(거래불가)

  /* 탈것(말, 기계, 날틀) 관련 */
 	(1000144, 2000144, 0, 26427, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 일리르 제오노스(거래불가)
  (1000145, 2000145, 0, 28087, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 천둥질주(거래불가)
  (1000146, 2000146, 0, 28138, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 검은 화살(거래불가)
  (1000147, 2000147, 0, 28638, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 당근질주(거래불가)
  (1000148, 2000148, 0, 28736, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 백야(거래불가)
  (1000149, 2000149, 0, 30209, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 묵뢰(거래불가)
  (1000150, 2000150, 0, 19604, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 탈 수 있는 젖소(거래불가)
  (1000151, 2000151, 0, 30878, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지의 딸(거래불가)
  (1000152, 2000152, 0, 30879, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지의 아들(거래불가)
  (1000153, 2000153, 0, 32566, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 번개(거래불가)
  (1000154, 2000154, 0, 29869, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 3세대 돌풍 소환 주문서(거래불가)
  (1000155, 2000155, 0, 29870, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 밭으로 5호 소환 주문서(거래불가)
  (1000156, 2000156, 0, 29871, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 혜성 3000 소환 주문서(거래불가)
  (1000157, 2000157, 0, 34314, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 소 달구지 소환 주문서(거래불가)
  (1000158, 2000158, 0, 16262, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 철갑 전차 소환 주문서(거래불가)
  (1000159, 2000159, 0, 34314, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 소 달구지 소환 주문서(거래불가)
  (1000160, 2000160, 0, 18174, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 이지 여신의 날틀(거래가능)
  (1000161, 2000161, 0, 18175, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 붉은 용 날틀(거래가능)
  (1000162, 2000162, 0, 23612, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 달빛 그림자 날틀(거래가능)
  (1000163, 2000163, 0, 23613, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 뇌우 날틀(거래가능)
  (1000164, 2000164, 0, 29199, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 자유의 날개(거래가능)
  (1000165, 2000165, 0, 30621, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 날틀 친구: 나무늘보(거래불가)
  (1000166, 2000166, 0, 29039, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 전설의 용날개(거래불가)

	/* 외형 관련 */
	(1000167, 2000167, 0, 29880, 1000, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 장비 외형변경 촉매제(거래가능)
	(1000168, 2000168, 0, 17662, 10, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무한한 상상의 염료(거래가능)
	(1000169, 2000169, 0, 17663, 10, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 무한한 상상의 틀(거래가능)
	(1000170, 2000170, 0, 30599, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- [할로윈] 피의 연회복 꾸러미(거래가능)
	(1000171, 2000171, 0, 30753, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 활기찬 야타 친구 꾸러미(거래가능)
	(1000172, 2000172, 0, 30754, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 발랄한 야타 친구 꾸러미(거래가능)
	(1000173, 2000173, 0, 30755, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 건강한 야타 해적 꾸러미(거래가능)
	(1000174, 2000174, 0, 30756, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 귀여운 야타 해적 꾸러미(거래가능)
	(1000175, 2000175, 0, 31152, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 베로에 옥좌 꾸러미(거래가능)
	(1000176, 2000176, 0, 31825, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 열대 햇살 꾸러미(거래불가)
	(1000177, 2000177, 0, 31989, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0), -- 명예 무기 꾸러미(거래불가)
	(1000178, 2000178, 0, 34262, 1, 0, 0, 0, NULL, 0, 0, 0, 0, 0); -- 여신의 무기 상자(거래불가)

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
